app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects" WHERE (lower(title) LIKE '%ne%' OR lower(duration) LIKE '%ne%' OR lower(leader) LIKE '%ne%'
SELECT COUNT(*) FROM "projects" WHERE (lower(title) LIKE '%%' OR lower(leader) LIKE '%%'
---
  def index

     # @projects = Project.order(sort_column + " " + sort_direction)
    if params[:term]
      @projects = Project.search(params[:term]).order(sort_column + " " + sort_direction).paginate(:page => params[:page], :per_page => 3)

INSERT INTO "projects" ("title", "duration", "leader", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save